Repository: seanpm2001/mt-training-data
Catalog: mhr/mhr_pontoon.tmx
Source language: en_us
Languages: mhr

source: We prefer natural/conversational sentences. While phonetic diversity and different words in sentences is important, we are trying to make recording sentences as much fun as possible. Therefore it would be great if you could try to keep your sentences as natural/engaging as possible.
mhr: Ме тыглай/кутырымо ойлончо-влакым сайлан шотлена. Кеч фонетике могырым тӱрлылык да ойлончылаште тӱрлӧ мут-влак кӱлешан улыт гынат, ме ойлончо возымашым путырак оҥайым ышташ тыршена. Сандене тый шке ойлончо-влакетым утларак тыглайым/шӱмештарышым ышташ тыршет гын, пеш сай лиеш ыле.

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
mhr: Ме тыйын информацийым перегаш сӧрена. Мемнан <privacyLink>Шолыплык нерген шижтарымаште</privacyLink> тӱрысрак луд.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
mhr: Ме почмо тӱҥалтыш код дене шуко йылман йӱк данныйым, кудым кажне еҥ йӱк дене ыштыше приложенийым туныкташ кучылтын кертеш, ыштена.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
mhr: Ме тӱҥалтыш почмо код дене йӱк данныйым краудсорсинг гоч погена. Шке йӱкетым надырле, вес еҥын клипшын чынлыкшым терге, чылалан данный погым сайракым ыште.

source: We’re experiencing unexpected downtime
mhr: Мемнан вучыдымо яра шогымаш жап

source: We’re going out to get coffee.
mhr: Ме кофем йӱаш лектына.

source: We release the dataset every 3 months.
mhr: Ме данный погым кажне 3 тылзыште савыктена.

source: We're receiving a lot of traffic and are currently investigating the issues.
mhr: Ме кугу трафикым налына да кызытсе жапыште нелылыкым шымлена.

source: We’re sorry, your platform is not currently supported.
mhr: Чаманыман, кызытсе жапыште тыйын платформо огеш кучылталт.

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
mhr: Кусарашлан ме <pontoonLink>Pontoon</pontoonLink> лӱман Mozilla-н ӱзгаржым кучылтына. Pontoon-ышто шуко йылме уло, но тыйын йылмет уке гын, тый <pontoonRequestLink>тудым ешараш манын, йодмашым</pontoonRequestLink> пуэн кертат. Вара, тудым Common Voice проектыште кучылташ лийже манын, <githubRepoLink>GitHub-ыште у йылмым йод</githubRepoLink>. <localizationFragment>Кумданрак кусарымаш сайтыште ончо</localizationFragment>.

source: We've run out of clips to validate in this language...
mhr: Мемнан тиде йылме дене тергашлан клип пытен...

source: We've run out of sentences to record in this language...
mhr: Мемнан тиде йылме дене возашлан ойлончо пытен...

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
mhr: Ме кутырымо модель-влак ойлышо-влакым кумданрак умылышт манын шонена. Тидлан йӱк датасет шуко тӱрлӧ еҥым авалтышаш.

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
mhr: Common Voice датасет йӱк, кудым ойлымым текстыш савырыше ӱзгар ир пӱртӱсыштӧ колеш, сайлыкым ончыктыжо манын, ме шонена, сандене ме тӱрлылыкым кычалына. Тӱрлӧ-тӱрлӧ ойлышо тӱшка деке ешарен тӱрлӧ сайлыкан датасет ойлымым текстыш савырыше механнизм тӱрлӧ илыш гыч налме лиймашым, фонан мутланымаш гыч автомобиль йӱк-йӱан марте, сеҥен кертеш. Тыйын йӱкан клипет умылаш лийме годым, тудо датасетлан шотан лийшаш.

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
mhr: Машине туныктымаш алгоритм-влак тӱрлӧ фонан йӱк-йӱаным сеҥен кертышт манын, ме шонена, тыгак ятыр кугу йӱк-влакат, тылат уло текстым колаш огыт мешае гын, налалтын кертыт. Шып фонан мурсем — ТУГЕ; ятыр кугу йӱк дене мурсем, кунам тый кажне мутым от кол — УКЕ.

source: We will also <strong>let our community manager know that you’re interested</strong>, so they can give you any extra support or information you might need.
mhr: Кумылет улмылан кӧра тылат кӱлын кертше кеч-могай ешартыш полышым але информацийым пуаш манын, ме тыгак <strong>мемнан тӱшкан менеджерлан увертарена</strong>.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
mhr: Ме Common Voice-ыш тыйын йылметым пуртымо шотышто ешартыш информацийым налашлан тый денет пеш писын кылдалтына.

source: We will be in touch with more information as it becomes available.
mhr: Ешартыш информаций пурымо семын тудым налашлан ме тый денет кылдалтына.

source: We will not make your email public.
mhr: Ме тыйын электрон почтым савыкташ огына тӱҥал.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
mhr: Ме датасет гыч тыйын йӱкан возыш-влакетым кораҥдаш йодмашетым ончен лектына. Тыйын йодмашет йӧраҥдалтеш гын, ме нунын дене, кӧ данный погым вераҥден, кылдалтына да тыйын йӱкан возыш-влакетым тыгак кораҥдаш йодына.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
mhr: Common Voice датасетыште ойлышо-влакын «кӧ улмыштым» пален налын ом керт манме мом ончыкта?

source: What is a language on Common Voice?
mhr: Common Voice-ышто йылме мо тугай?

source: What is Common Voice?
mhr: Мо тугай Common Voice?

source: What issues are you experiencing with this sentence?
mhr: Тиде ойлончо дене тыйын могай нелылык лектын?

source: What kind of goal do you want to build?
mhr: Могай шумлыкым тый ыштынет?

source: What level of audio quality is required for a voice clip to be used in the dataset?
mhr: Йӱкан клипын йӱкшӧ, кудо данный погышто кучылталташ тӱҥалеш, могайрак сайлыкан лийшаш?

source: What’s inside the Common Voice dataset?
mhr: Common Voice данный кӧргыштӧ мо уло?

source: What's Public?
mhr: Мом чылан кучылтын кертыт?

source: What’s the difference between Common Voice and Deep Speech?
mhr: Common Voice да Deep Speech коклаште могай ойыртем?

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
mhr: Пайдаланыше йӱкан клипым ӧрдыжтара гын, тудо черетыш пӧртылеш. Угычын ӧрдыжтарыме деч вара, тудо клип шӱгарыш кусаралтеш.

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
mhr: Колыштмо годым мом йӱкаҥдыме ыле лачшымак тидымак возымо лиймым пеш тӱткын тергыза; изирак йоҥылыш уло гынат, ӧрдыжтараш. <br />Пеш чӱчкыдӧ йоҥылышлан шотлалтыт:

source: When will you release Common Voice data in other languages?
mhr: Кузе тый Common Voice данныйым вес йылме дене савыктет?

source: When you request your recordings, we compile them into one or multiple ZIP files. Here are your past requests:
mhr: Кунам тый шке возымаш-влакетым йодат, ме нуным ик але икмыняр ZIP-файлыш погена. Теве тыйын ондакысе йодмаш-влакет:

source: Where are these <wikipediaLink>public domain</wikipediaLink> sentences from?
mhr: Кушечын нине <wikipediaLink>чылалан кучылташ лийше</wikipediaLink> ойлончо-влак?

source: Where does the source text come from?
mhr: Йӱкаҥдашлан текст кушеч налалтеш?

source: Which variant of { $language } do you speak?
mhr: { $language } йылмын могай тӱрлылыкшӧ дене тый мутланет?

source: Why ?
mhr: Молан?

source: Why a profile?
mhr: Молан профиль кӱлеш?

source: Why Common Voice?
mhr: Молан Common Voice?

source: Why does this matter?
mhr: Молан тиде кӱлешан?

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
mhr: Молан тый еҥ-влакым тӱрлӧ йылме дене книгалам але википедий гыч статья-влакым лудаш от йод?

source: Why do you need so many different speakers per language?
mhr: Молан тыланда ик йылме денак кутырышо тынар шуко еҥ?

source: Why is 10,000 validated hours the per language goal for capturing audio?
mhr: Молан 10,000 тергыме шагат йӱкым авалтымылан йылме шумлык улеш?

source: Why is Common Voice part of the Mozilla mission?
mhr: Молан Common Voice Mozilla-н миссийжын ужашыже улеш?

source: Why is it important?
mhr: Молан тиде кӱлешан?

source: Why is my language not included yet?
mhr: Молан мыйын йылмем эше ешарыме огыл?

source: Why should I sign up for an account?
mhr: Молан мый регистрацийым эртышаш улам?

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
mhr: Тый тыгак тыйын йӱкан возымаш-влакым кораҥдаш йоднет але нуным Common Voice датасетыште аралаш шонет?

source: Xhosa
mhr: Коса

source: Xitsonga
mhr: Тсонга

source: y
mhr: т

source: Y
mhr: Т

source: Yes
mhr: Туге

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
mhr: Туге, электрон серышлам мылам колтедылза. Мый Common Voice проект нерген пален шогынем.

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
mhr: Туге, электрон серышлам мылам колтедылза. Мый Тӱшка Common Voice-ышто тиде йылмын вияҥмашыж нерген пален шогынем.

source: Yes, we especially want your voice! Part of the aim of Common Voice is to gather as many different accents as possible so that voice recognition services work equally well for everyone. This means donations from non-native speakers are particularly important.
mhr: уге, тыйын йӱкет мыланна поснак кӱлеш! Common Voice-ын шумлыкшын ужашыже — йӱкым пален налше службо-влак чылалан сайын ыштыже манын, тӱрлӧ акцентым шукырак погаш. Тиде йылмым нумалше огыл еҥын надырлымыжым поснак кӱлешаным ончыкта.

source: Yiddish
mhr: Идиш

source: Yoruba
mhr: Йоруба

source: You
mhr: Тый

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
mhr: Тый <size>{ $size }ГБ</size> вераҥдымашым ышташ ямдылалтат, шуяш?

source: You are prepared to initiate a download of <b>{ $size }</b>
mhr: Мый <b>{ $size }</b> тулен налмым тӱҥалаш ямде улат

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
mhr: Тый тыгак вияш URL-адрес-влакым копироватлен да шке йӧратыме вераҥдымаш менеджерышкет шынден кертат. Нунын ыштыме жапышт 12 шагат гыч пыта, но тый тиде велыжыш, кеч-могай жапыште уым ышташ манын, пӧртылын кертат.

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
mhr: Тый тыгак полдыш-влакым келыштарен кучылтын кертат: { sc-review-form-button-approve-shortcut } чынлашлан, { sc-review-form-button-reject-shortcut } ӧрдыжтарашлан, { sc-review-form-button-skip-shortcut } коден каяшлан

source: You can choose to make your username public or anonymous.
mhr: Тый шке пайдаланыше лӱметым чылалан койшым але лӱмдымым ыштен кертат.

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
mhr: Тый <datasetsPage>датасет велыжыш</datasetsPage> куснен, кӱлеш версийым да йылмым (йылме-влакым) ойырен да нуным тулен налын кертат! Файл-влак демографиян информаций да тергымаш данный дене <metadataLink>метаданный-влак дене кылдалтыныт</metadataLink>. Тылат датасетым тулен налашлан электрон почто адресым ончыктыман.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
mhr: Common Voice-ышто профильым ыштен да шке йӱкетым надырлен, тый почмо тӱҥалтыш код дене тӱрлӧ датасетым ышташ полшен кертат.

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
mhr: Темым каҥашашлан <discourseLink>Каҥашымашыш</discourseLink> але писе каҥашлан <matrixLink>Matrix</matrixLink> деке ушнен тый Mozilla-н йылме тӱшкалаш моло ушнышо-влак дене палыме лийын кертат.

source: You cannot request your recordings while another request is already in progress.
mhr: Вес йодмаш шукталтме годым, тый шке возымаш-влакетым йодын от керт.

source: You can request a new takeout of your recordings every { $days } days.
mhr: Тый шке возымаш кокла гыч у возымаш-влакым кажне { $days } кече йодын кертат.

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
mhr: Еҥ-влаклан шке надырыштым пурташлан тый тӱшкасомыл-влакым эртарен кертат. Тиде тыйын шонымет деч куштылгырак. Тый тидым онлайн видеоконференций ӱзгар дене але шке, тиде лӱдыкшӧ огыл гын, ыштен кертат. <eventTemplate>Мемнан шаблон да тӱшкасомылым эртарашлан ресурс-влак дене палыме лий</eventTemplate>.

source: You can <scLinkAdd>add small numbers</scLinkAdd> of sentences here, or you can do <bulkImportDocsLink>bulk imports</bulkImportDocsLink> via a Github request. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own. See more on <scFragment>sentence collection</scFragment>.
mhr: Тый тышке <scLinkAdd>икмыняр ойлончым ешарен</scLinkAdd> кертат але Github йодмаш гоч <bulkImportDocsLink>тӱшка импортым</bulkImportDocsLink> шуктен кертат, Шарне, ойлончо-влак <licenseLink>CC0 (але калык поянлык)</licenseLink> лийшаш улыт, але тый шкеным возен кертат. <scFragment>Ойлончо пого</scFragment> нерген кумданрак.

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
mhr: Тый <sentenceCollectorLinkAdd>икмыняр, шуко огыл ойлончым ешарен</sentenceCollectorLinkAdd>, але <bulkImportDocsLink>Github полшымо дене тӱшка импортым</bulkImportDocsLink> ыштен кертат. Ойлончо-влак <licenseLink>CC0 (але чылалан кучылташ лийше)</licenseLink> лийшаш уылт, але тый шкендыным возен кертат.

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
mhr: Википедий гыч кӱчык ойлончо-влакым кучылташлан тый <scraperLink>Ойлончо луктедылшым</scraperLink> кучылтын кертат.

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
mhr: Тый веб-сайтым ончыктен кертат, мутлан, «Common Voice — https://commonvoice.mozilla.org/»

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
mhr: Тый академийысе кылвер стильым, мутлан «Mozilla (2021) Common Voice. https://commonvoice.mozilla.org/ адрес дене кучылташ лиеш. (Кучылтмо: 2021 ий идым тылзын 15-ше кечыже)» Гарвардысе стильым кучылтын кертат.

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
mhr: Увертышым намиен шукташ манын, тый социал вот платформылам кучылтын кертат. Молан тиде кӱлешан манмым умылтарыше савыктымаш дене пайлалт, да йылме права, йӱкан AI але технологийлаште темдымаш йодыш нерген мутланыше вес еҥ-влак дене кылдалт. <campaignLink>Социал кампанийлам эртарашлан ешартыш каҥаш дене, тыйын угычын кучылтын кертме материалым авалтен</campaignLink>, палыме лий.

source: You have not added any languages yet.
mhr: Тый эше нимогай йылмым ешарен отыл.

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
mhr: Тый ик йылмымат ойырен отыл. Порылий, йылме-влакым ойырашлан шке <profileLink>Профильышкет</profileLink> кусно.

source: You must allow microphone access.
mhr: Тый микрофоным кучылтын кертмым ыштышаш улат.

source: You previously skipped sentences while reviewing. Resetting skipped sentences will show all skipped sentences again. This is independent of the language.
mhr: Ончымо годым ондакрак тый ойлончо-влакым коден каенат. Коден кайыме ойлончо-влакым кудалтымаш чыла коден кайыме ойлончым угычын ончыктымашке наҥгая. Тиде йылме дечын огеш шого.

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
mhr: Акцентет — тиде кузе тый мут-влакым кутырет. Тиде кушто илымет, могай йылме-влак дене мутланымет да моло амал деч шога. Тый тыште кеч-могай информаций дене, кудо тыйын шонымаште пашалан кӱлешан, пайлалт кертат.

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
mhr: Тыйын лӱмдымӧ йӱкан возыш-влакет Common Voice датасетеш кодыт. Шке профилет кораҥдыме деч вара тый датасет гыч шке возыш-влакетым кораҥдаш йодмашым тетла колтен от керт

source: Your daily goal has been created
mhr: Кежне кечылан шумлыкет ышталтын

source: Your download has started.
mhr: Тыйын вераҥдымаш тӱҥалын.

source: You’re contributing to a target segment
mhr: Тый шумлык ужашыш шке надыретым пуртет

source: You’re contributing to our first target segment
mhr: Мемнан икымше шумлык ужашыш тый шке надыретым пуртет

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
mhr: Кызытсе жаплан тый шумлык нерген шижтарымаш, мыйын ончыко кайымаш да Common Voice нерген увертармаш дене электрон серышлам наледашлан <bold>ОГЫЛ</bold> келыштаралтынат

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
mhr: Кызытсе жаплан тый шумлык нерген шижтарымаш, мыйын ончыко кайымаш да Common Voice нерген увертармаш дене электрон серышлам наледашлан келыштаралтынат

source: Your email address
mhr: Тыйын электрон почто адресет

source: Your files are being assembled. Please check again later.
mhr: Тыйын файл-влак погалтыт. Порылий, варарак терге.

source: Your languages:
mhr: Йылме-влакет:

source: Your Languages
mhr: Йылме-влакет

source: Your username and email will not be associated with the published data.
mhr: Пайдаланыше лӱмет да электрон почто адресет савыктыме данный дене кылдалтме огыт лий.

source: Your weekly goal has been created
mhr: Кажне арнялан шумлыкет ышталтын

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
mhr: Тый кӱчык умылтарымаш дене электрон серышым налшаш улат тушто тыйын йылметым Common Voice-ыш ешарыме шотышто ошкыл-влак

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
mhr: Тый Common Voice-лан мемнан кажне кечысе { $goalValue } возымаш дене шумлыкыш шуаш полшышыч!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
mhr: Тый Common Voice-лан мемнан кажне кечысе { $goalValue } тергымаш дене шумлыкыш шуаш полшышыч!

source: You've successfully signed up for contributing to { $language }. Thank you.
mhr: Тый { $language } йылме дене пашам ышташлан эсен возалтынат. Тау.

source: Zip #{ $offset } of { $total }
mhr: Zip №{ $offset } / { $total }

source: Zulu
mhr: Зулу

source: abnormality
mhr: келшыдыме

source: account recovery key
mhr: аккаунтым пӧртылтымӧ ключ

source: add-on
mhr: ешартыш

source: aggregate
mhr: чумыр

source: All Hands
mhr: Чыла кид

source: alternate text
mhr: вес текст

source: appear
mhr: лекташ

source: appearance
mhr: тӱжвал тӱс

source: attack
mhr: керылтмаш

source: attacker
mhr: керылтше

source: Attack Site
mhr: Керылташлан сайт

source: attendee
mhr: ушнышо

source: authenticate
mhr: авторизацийым эрташ

source: authenticated
mhr: авторизацийым эртыше

source: autoplay
mhr: вигак модыкташ

source: back out
mhr: пӧртылаш

source: backup authentication code
mhr: аутентификацийлык шапаш код

source: black box
mhr: шем яшлык

source: bookmark
mhr: ушештартыш

source: boolean
mhr: логике

source: boot
mhr: вераҥдалташ

source: breakpoint
mhr: шогалме точко

source: Bug report
mhr: Йоҥылыш нерген увертыш

source: certificate authority
mhr: сертификаций рӱдер

source: channel
mhr: канал

source: cipher
mhr: шифр

source: clipboard
mhr: вашталтыш буфер

source: clockwise
mhr: шагат умдо почеш

source: colorway
mhr: тӱс корно

source: compact
mhr: изи кугытан

source: compact - recommend deprioritize
mhr: изи кугыт - приоритетлыкым чараш темлена

source: context
mhr: контекст

source: contribute
mhr: надырлаш

source: corrupt
mhr: йӧрдымӧ

source: corrupted
mhr: йӧрдымӧ

source: counterclockwise
mhr: шагат умдо ваштареш

source: cryptominer
mhr: криптомайнер

source: cryptomining
mhr: криптомайнинг

source: debug
mhr: лачештараш

source: deceptive site
mhr: ондалчык сайт

source: decode
mhr: шифрым палаш

source: decryption
mhr: шифрым палымаш

source: disinformation
mhr: дезинформаций

source: distrust
mhr: ÿшаныдымаш

source: eavesdropping
mhr: колыштмаш

source: enable
mhr: чӱкташ

source: encode
mhr: шифроватлаш

source: encrypt
mhr: шифроватлаш

source: encryption
mhr: шифроватлымаш

source: end user
mhr: мучашле пайдаланыше

source: Enhanced Tracking Protection
mhr: Эскерыме деч саемдыме аралалтмаш

source: executable file
mhr: шуктымо файл

source: extension
mhr: кумдаҥдымаш

source: external
mhr: тӱжвал

source: Fellow
mhr: Йолташ

source: filter bubble
mhr: шӱре шӱвыроҥ

source: fingerprinter
mhr: парня палым налше

source: fingerprinting
mhr: парня палым налмаш

source: Firefox View
mhr: Firefox-ышто ончаш

source: gear
mhr: механизм

source: grassroots
mhr: ӱлыл

source: home page
mhr: тӱҥ велыж

source: idle
mhr: паша деч посна

source: import
mhr: импортироватлаш

source: innovations
mhr: улык

source: insecure
mhr: лӱдыкшӧ

source: installation
mhr: шындымаш

source: Issue
mhr: Йодыш

source: L10n
mhr: локализаций

source: Legacy extension
mhr: Тошто кумдаҥдымаш

source: misinformation
mhr: дезинформаций

source: native
mhr: шочмо

source: open source
mhr: почмо тӱҥалтыш код

source: override
mhr: чараш

source: participation
mhr: ушнымаш

source: Patch
mhr: Тумыш

source: pop-up
mhr: лекше окна
